app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "History of Art"], ["room_number", 690], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class = SchoolClass.update(params.require(:school_class).permit(:title, :room_number))