app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Claire"], ["last_name", "Gorick"], ["updated_at", "2020-04-25 22:34:56.435110"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student = Student.update(params.require(:student).permit(:first_name, :last_name))